# Задача 2. Напишите программу, которая на вход принимает 5 чисел и находит максимао=льное из них.

a,b,c,d,e = int(input()),int(input()),int(input()),int(input()),int(input())
print(f'Максимальное число: {max(a,b,c,d,e)}')

